#include<stdio.h>
/*
intermediate                        raw_material               product
0反射镜                              铁锭                      太阳能板1 
1红石接收线圈                        玻璃                      太阳能板2
2机器框架（基础）                    木板                      太阳能板3 
3铅石能量元件框架                    红石                      太阳能板4 
4光电池I                             金锭                      太阳能板5 
5锡齿轮                              青金石                     
6光电池II                            锡锭 
7机器框架（硬化）                    铅锭 
8琥珀金齿轮                          粘土 
9硬化能量元件框架                    银锭 
10琥珀金锭                           镍锭 
11殷钢锭                             铜锭 
12光电池III                          钻石 
13机器框架（强化）                   黑曜石 
14信素齿轮
15强化玻璃
16信素锭
17红石能量单元框架
18
19
20
21
22
23


*/ 
